In [2]:
import pandas as pd
df = pd.read_csv('C:\\Users\\lenovo\\Desktop\\trail_(1).csv')
df

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow
2    3    65    56   sunny

In [5]:
rows , coloums = df.shape
print(rows,coloums)

3 4

In [6]:
 df.head(2)

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow

In [7]:
df.tail(2)

   row  temp  wind weather
1    2    34    34    snow
2    3    65    56   sunny

In [8]:
df[1:3]

   row  temp  wind weather
1    2    34    34    snow
2    3    65    56   sunny

In [10]:
len(df.columns)

4

In [11]:
df.temp

0    12
1    34
2    65
Name: temp, dtype: int64

In [12]:
df['temp']

0    12
1    34
2    65
Name: temp, dtype: int64

In [14]:
df[['temp','wind']]

   temp  wind
0    12    23
1    34    34
2    65    56

In [18]:
print(df['temp'].max())
print(df.temp.mean())
print(df.temp.min())
df.temp.std()

65
37.0
12

26.627053911388696

In [19]:
df.describe()

       row       temp       wind
count  3.0   3.000000   3.000000
mean   2.0  37.000000  37.666667
std    1.0  26.627054  16.802778
min    1.0  12.000000  23.000000
25%    1.5  23.000000  28.500000
50%    2.0  34.000000  34.000000
75%    2.5  49.500000  45.000000
max    3.0  65.000000  56.000000

In [20]:
df[df.temp>=23]

   row  temp  wind weather
1    2    34    34    snow
2    3    65    56   sunny

In [21]:
df[df.temp== df.temp.max()]

   row  temp  wind weather
2    3    65    56   sunny

In [22]:
df

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow
2    3    65    56   sunny

In [23]:
df['wind'][df.temp== df.temp.max()]

2    56
Name: wind, dtype: int64

In [24]:
df['weather'][df.temp == df.temp.max()]

2    sunny
Name: weather, dtype: object

In [25]:
df.weather[df.temp == df.temp.max()]

2    sunny
Name: weather, dtype: object

In [26]:
df[['weather','wind']][df.temp==df.temp.max()]

  weather  wind
2   sunny    56

In [30]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [34]:
df.set_index('row')

     temp  wind weather
row
1      12    23    rain
2      34    34    snow
3      65    56   sunny

In [35]:
df

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow
2    3    65    56   sunny

In [36]:
df1 = df.set_index('row')

In [38]:
df1

     temp  wind weather
row
1      12    23    rain
2      34    34    snow
3      65    56   sunny

In [39]:
df.set_index('row',inplace = True)

In [40]:
df

     temp  wind weather
row
1      12    23    rain
2      34    34    snow
3      65    56   sunny

In [41]:
df.loc[1]

temp         12
wind         23
weather    rain
Name: 1, dtype: object

In [42]:
df.reset_index(inplace = True)

In [43]:
df

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow
2    3    65    56   sunny

In [45]:
df[0:2]

   row  temp  wind weather
0    1    12    23    rain
1    2    34    34    snow